{
    "version": "2.0",
    "title": "HomeAssistant",
    "name": "homeassistant",
    "icon": "https://cdn.jsdelivr.net/gh/IceWhaleTech/CasaOS-AppStore@main/Apps/HomeAssistant/icon.png",
    "tagline": "Open source home automation that puts local control and privacy first.",
    "overview": "Home Assistant is a smart home management app prioritizing local control and data privacy, managing devices through an intuitive interface with data stored locally, eliminating cloud dependency. Its robust features and community support make it ideal for DIY enthusiasts and home users creating personalized home experiences.\n\nThe app's core features include customizable dashboards, powerful automations, and a voice assistant. Dashboards support drag-and-drop customization, with various card types to display data and control devices like lights or sensors. It offers an advanced automation engine, such as turning on lights at sunset or alerting users to an open garage door. The Assist voice assistant enables natural language control, compatible with phones, tablets, smartwatches, and even traditional telephones, allowing users to customize interactions and experiment with AI conversations to meet diverse needs.\n\nIt extends functionality through add-ons, supporting tools like AdGuard for ad blocking, NodeRed for third-party automations, or turning devices into Spotify Connect targets. Home energy management optimizes solar production and usage planning to save costs. Home Assistant Cast transforms TVs into dashboard displays, and NFC tags trigger music playback or routine automations. Community documentation aids configuration, with local data processing ensuring privacy, suitable for home or small team smart home management.\n\n**Key Features:**\n- Local data storage, prioritizing privacy\n- Drag-and-drop customizable dashboards for device control and data display\n- Advanced automations for triggering smart home events\n- Assist voice assistant for natural language control\n- Add-ons for integrating AdGuard, NodeRed, and more\n- Home energy management for optimized usage and cost savings\n- Home Assistant Cast for TV dashboard displays\n- NFC tags for triggering music or automation tasks\n\n**Learn More:**\n- [Home Assistant Official Website](https://www.home-assistant.io)\n- [Home Assistant GitHub Repository](https://github.com/home-assistant/core)\n- [Home Assistant Documentation](https://www.home-assistant.io/docs)\n- [Home Assistant Community](https://community.home-assistant.io)\n- [Home Assistant Add-ons](https://www.home-assistant.io/addons)\n",
    "thumbnail": "https://cdn.jsdelivr.net/gh/IceWhaleTech/CasaOS-AppStore@main/Apps/HomeAssistant/thumbnail.png",
    "screenshots": [],
    "category": [
        "Home Automation"
    ],
    "developer": {
        "name": "",
        "website": "",
        "donate_text": "",
        "donate_link": ""
    },
    "adaptor": {
        "name": "CasaOS Team",
        "website": "https://www.casaos.io",
        "donate_text": "",
        "donate_link": ""
    },
    "support": "",
    "website": "",
    "container": {
        "image": "homeassistant/home-assistant:2025.11",
        "shell": "bash",
        "privileged": false,
        "network_model": "bridge",
        "web_ui": {
            "http": "",
            "path": ""
        },
        "health_check": "",
        "envs": [],
        "ports": [],
        "volumes": [
            {
                "container": "/config",
                "host": "/DATA/AppData/$AppID/config",
                "mode": "rw",
                "allocation": "automatic",
                "configurable": "no",
                "description": "HomeAssistant config directory."
            }
        ],
        "devices": [],
        "constraints": {
            "min_memory": 0,
            "min_storage": 0
        },
        "restart_policy": "",
        "sysctls": [],
        "cap_add": [],
        "labels": [],
        "host_name": "",
        "cmd": []
    },
    "abilities": {
        "notification": false,
        "widgets": false,
        "authentication": false,
        "search": false,
        "upnp": false
    },
    "tips": {
        "before_install": []
    },
    "changelog": {
        "latest_updates": "",
        "url": ""
    },
    "latest_update_date": ""
}
